
{
  "menu"  : {
              "starters":   {
                            "notes":  [],
                            "items":  [
                                      {
                              "name":   "Fried Pickles",
                              "price":  14,
                              "desc":   "Hand-breaded pickle chips served with our Boom Boom Sauce."
                            },
                                      {
                              "name":   "Cheese Curds",
                              "price":  16,
                              "desc":   "Flash fried NYS white cheddar cheese curds served with marinara sauce."
                            },
                                      {
                                        "name":   "Pub Pretzel Sticks",
                                        "price":  14,
                                        "desc":   "Soft pretzel sticks with choice of mustard or housemade cheese sauce.",
                                        "notes":  ["MAKE THEM IRISH STYLE: +5"]
                                      },
                                      {
                                        "name":   "Pot Roast Poutine",
                                        "price":  17,
                                        "desc":   "Guiness braised Certified Angus Beef® pot roast over jack fries with white cheddar cheese curds and homemade gravy.",
                                        "notes":  []
                                      },
                                      {
                                        "name":   "Irish Nachos",
                                        "price":  14,
                                        "desc":   "Jack fries, 5-cheese sauce, shredded cheddar jack, bacon, scallions, and side of ranch.",
                                        "notes":   ["Add Chicken +7","Add Corned Beef +7","Add Short Rib +8"]
                                      },
                                      {
                                        "name":   "Boom Boom Short Rib Nachos",
                                        "price":  17,
                                        "desc":   "Five cheese sauce, shredded cheddar jack, honey Cajun corn, tomato, red onion, and Boom Boom sauce served with sour cream and salsa."
                                      },
                                      {
                                        "name":   "Boom Boom Shrimp",
                                        "price":  18,
                                        "desc":   "Flash fried shrimp tossed in Boom Boom sauce and served with a side of blue cheese dressing."
                                      },
                                      {
                                        "name":   "Fried Calamari",
                                        "price":  18,
                                        "desc":   "Crispy flash fried calamari, banana, and hot pepper rings tossed in parmesan cheese and served with lemon and red sauce."
                                      },
                                      {
                                        "name":   "Chicken Tenders",
                                        "price":  16,
                                        "desc":   "Four chicken tenders served with Jack fries."
                                      }
                                    ]
                          },
              "wings":      {
                            "notes":["Hot | Mild | Cajun  | BBQ | Garlic Parmesan | Blue & Gold","Guinness Gold | Boom Boom | Firecracker | Sweet & Sour"],
                            "items":  [
                                        {
                                          "name":   "Famous Boneless Chicken Wings",
                                          "price":  15,
                                          "desc":   "Jack's breaded boneless wings with your choice of sauce."
                                        },
                                        {
                                          "name":   "Traditional Chicken Wings",
                                          "price":  17,
                                          "desc":   "Bone-in chicken wings with your choice of sauce."
                                        }
                                      ]
                          },
              "salads":     {
                            "notes":  ["Add to any salad:","Steak +10","Chicken +7","Salmon +10","Shrimp +8"],
                            "items":  [
                                        {
                                          "name":   "Caesar",
                                          "price":  15,
                                          "desc":   "Crisp romaine, shaved asiago, parmesan cheese and house croutons, tossed in a creamy Caesar dressing."
                                        },
                                        {
                                          "name":   "Shamrock",
                                          "price":  14,
                                          "desc":   "Pepperoncini, cucumber, tomato, red onion, shredded cheddar jack cheese, and house croutons on a bed of mixed greens with choice of dressing."
                                        },
                                        {
                                          "name":   "Buffalo Chicken",
                                          "price":  19,
                                          "desc":   "Boneless wings tossed in spicy Buffalo sauce served over mixed greens with tomatoes, blue cheese crumbles and shredded cheddar jack cheese"
                                        },
                                        {
                                          "name":   "Asian Salmon",
                                          "price":  24,
                                          "desc":   "Jameson-glazed salmon, Mandarin oranges, cucumber, scallions, and red onion over a bed of mixed greens with ranch and Firecracker sauce."
                                        },
                                        {
                                          "name":   "Steak Salad",
                                          "price":  23,
                                          "desc":   "A seared Certified Angus Beef® sirloin steak over mixed greens with red onion, tomato, cucumber, carrots, and blue cheese crumbles with choice of dressing."
                                        },
                                        {
                                          "name":   "Calamari Salad",
                                          "price":  21,
                                          "desc":   "Crispy flash fried calamari and banana peppers tossed in parmesan cheese over mixed greens, tomato with shaved asiago and balsalmic vinaigrette."
                                        },
                                        {
                                          "name":   "Blackened Shrimp",
                                          "price":  22,
                                          "desc":   "Blackened tiger shrimp served over mixed greens with carrots, tomato, cucumber, red onion, and choice of dressing."
                                        },
                                        {
                                          "name":   "Wedge",
                                          "price":  16,
                                          "desc":   "Wedges of baby iceberg lettuce topped with tomato, cucumbers, red onion, blue cheese crumbles and bacon crumbles, served with creamy blue cheese dressing."
                                        },
                                        {
                                          "name":   "Summer Salad",
                                          "price":  "",
                                          "desc":   "Strawberries, candied pecans, goat cheese crumbles and red onion on a bed of baby spinach, served with balsalmic."
                                        }
                                      ]
                          },
              "soups":      {
                            "notes":  [],
                            "items":  [
                                        {
                                          "name":   "Soup O' The Day",
                                          "price":  6,
                                          "desc":   "Daily Feature: Hand crafted by our chefs."
                                        },
                                        {
                                          "name":   "Jack's Onion Soup",
                                          "price":  8,
                                          "desc":   "Caramelized onions in a rich Guiness-Sherry broth, topped with parmesan gratin."
                                        }
                                      ]
                          },
              "flatbreads": {
                              "notes":  [],
                              "items":  [
                                          {
                                            "name":   "Reuben",
                                            "price":  17,
                                            "desc":   "Daily Feature: Hand crafted by our chefs."
                                          },
                                          {
                                            "name":   "Four Cheese",
                                            "price":  15,
                                            "desc":   "Cheddar jack, mozzarella, provolone and parmesan cheeses with garlic parmesan sauce."
                                          },
                                          {
                                            "name":   "Garlic Pepperoni",
                                            "price":  16,
                                            "desc":   "Mozzarella cheese, pepperoni, and garlic parmesan sauce."
                                          },
                                          {
                                            "name":   "Veggie",
                                            "price":  16,
                                            "desc":   "Carmelized onions, broccoli and a white garlic base."
                                          }
                                        ]
                            },
              "handhelds":  {
                              "notes":  ["All burgers and handhelds are served with choice of Fries, Irish Potatoes, Mac Salad, Coleslaw, or Honey Cajun corn.","Add side garden salad +4","Substitute French Onion Soup +4, Soup Du Jour +4, Fried Pickles +4, or Onion Rings +4"],
                              "items":  [
                                          {
                                            "name":   "Reuben",
                                            "price":  18,
                                            "desc":   "Corned beef, sauerkraut, Swiss cheese, and creamy Thousand Island dressing on grilled marbled rye bread."
                                          },
                                          {
                                            "name":   "Pot Roast Grilled Cheese",
                                            "price":  18,
                                            "desc":   "Braised Certified Angus Beef® pot roast, caramelized onions, American cheese, cheddar jack cheese, and horseraddish sauce on grilled sourdough bread."
                                          },
                                          {
                                "name":   "Buffalo Chicken Grilled Cheese",
                                "price":  17,
                                "desc":   "Crispy chicken tossed in spicy Buffalo sauce with Provolone, American, cheddar jack, and blue cheese crumbles on grilled sourdough bread."
                              },
                                          {
                                "name":   "Chicken Sandwich",
                                "price":  16,
                                "desc":   "Grilled chicken breast, lettuce, tomato, bacon, and provolone cheese on a toasted roll."
                              },
                                          {
                                "name":   "Turkey B.L.T.",
                                "price":  18,
                                "desc":   "Fresh turkey with lettuce, tomato, bacon and mayo on grilled sourdough."
                              },
                                          {
                                "name":   "Spicy Steak Sandwich",
                                "price":  19,
                                "desc":   "Grilled and chopped Certified Angus Beef® ribeye steak, caramelized onions, banana peppers, hot peppers, cheese sauce and melted cheddar jack on a grilled roll."
                              },
                                          {
                                            "name":   "Jack Burger",
                                            "price":  17,
                                            "desc":   "A Certified Angus Beef® burger, lettuce, tomato, and American Cheese, on a grilled hard roll."
                                          },
                                          {
                                            "name":   "Irish Burger",
                                            "price":  18,
                                            "desc":   "A Certified Angus Beef® burger, lettuce, tomato, corned beef, Guinness Gold sauce, and Swiss cheese on a grilled hard roll."
                                          },
                                          {
                                            "name":   "Dublin Burger",
                                            "price":  19,
                                            "desc":   "A Certified Angus Beef® burger, lettuce, tomato, caramelized onions, pot roast, bacon, American and Swiss cheeses and Boom Boom sauce on a grilled hard roll."
                                          },
                                          {
                                            "name":   "Top O' The Mornin' Burger",
                                            "price":  19,
                                            "desc":   "A grilled Certified Angus Beef® burger, applewood bacon, a fried egg, meat hot sauce, and American  cheese. Served on a grilled hard roll."
                                          }
                                        ]
                            },
              "entrees":    {
                              "notes":  ["All entrees are served with seasonal vegetables and mashed potatoes.","Add side garden salad +4","Subsitute French Onion, Soup Du Jour, Fried Pickles, or Onion Rings +4"],
                              "items":  [
                                          {
                                            "name":   "Smothered Delmonico",
                                            "price":  36,
                                            "desc":   "A 14 oz Certified Angus Beef® Delmonico (ribeye) steak, carmelized onion, portabello mushroom, and demi glaze."
                                          },
                                          {
                                            "name":   "Herb Butter Ribeye",
                                            "price":  34,
                                            "desc":   "A 14 oz Certified Angus Beef® ribeye steak with shamrock herb butter."
                                          },
                                          {
                                            "name":   "Braised Beef Short Rib",
                                            "price":  29,
                                            "desc":   "8 oz slow braised boneless Certified Angus Beef® short rib and demi-glace."
                                          },
                                          {
                                            "name":   "Cheddar Chicken",
                                            "price":  24,
                                            "desc":   "(2) grilled chicken breasts topped with bacon and shredded cheddar jack cheese."
                                          },
                                          {
                                            "name":   "Garlic Shrimp Dinner",
                                            "price":  25,
                                            "desc":   "(12) Broiled jumbo shrim with shamrock herb butter."
                                          },
                                          {
                                            "name":   "Salmon",
                                            "price":  26,
                                            "desc":   "A 8 oz pan seared filet of fresh salmon and shamrock herb butter."
                                          },
                                          {
                                            "name":   "Cottage Pie - Our Take on Shepherd's Pie",
                                            "price":  21,
                                            "desc":   "Certified Angus Beef® short rib, celery, peas, carrots and onions in a rich Guinness sauce and topped with smashed potatoes and cheddar jack cheese."
                                          },
                                          {
                                            "name":   "Mac 'N Cheese",
                                            "price":  18,
                                            "desc":   "Rotini pasta and five cheese sauce topped with breadcrumbs."
                                          },
                                          {
                                            "name":   "Buffalo Mac 'N Cheese",
                                            "price":  21,
                                            "desc":   "Rotini pasta and five cheese sauce. with hot sauce &amp; chicken tenders, topped with breadcrumbs."
                                          },
                                          {
                                            "name":   "Shamrock Plate",
                                            "price":  18,
                                            "desc":   "A 4 oz Certified Angus Beef® patty with American cheese, a Zweigles hot dog, fries, mac salad, and meat hot sauce."
                                          }
                                        ]
                            },
              "promotions": {
                              "notes":  [],
                              "items":  [
                                          {
                                            "name":   "St. Patrick's Day",
                                            "price":  "",
                                            "desc":   "The biggest St. Patrick's Day celebration in Rochester!"
                                          },
                                          {
                                            "name":   "St. 'Practice' Day",
                                            "price":  "",
                                            "desc":   "On the 17th of every month, we have an Irish menu, along with drink specials on Guinness, Smithwick, Harp, and Roe &amp; Co Irish whiskey."
                                          },
                                          {
                                            "name":   "Bingo",
                                            "price":  "",
                                            "desc":   "The last Sunday of every month."
                                          },
                                          {
                                            "name":   "Whiskey Wednesday",
                                            "price":  "",
                                            "desc":   "Free whiskey tastings on the first Wednesday of every month."
                                          }
                                        ]
                            },
              "drinks": {
                              "notes":  [],
                              "items":  [
                                          {
                                            "name":   "We have Guinness, Harp, and Smithwick's on draft, along with a rotating selection of other beers!",
                                            "price":  "",
                                            "desc":   ""
                                          },
                                          {
                                            "name":   "We carry a wide range of Irish whiskey, including Jameson, Roe &amp; Co, and Lost Irish, along with a wide range of other whiskies and spirits!",
                                            "price":  "",
                                            "desc":   ""
                                          }
                                        ]
                            }

            }
}
